Revit 2027 API
RebarBendingDetail.SetPosition Method
 Sets the position for this bending detail relative to its view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetPosition(
	Element bendingDetail,
	XYZ position
)
Public Shared Sub SetPosition (
	bendingDetail As Element,
	position As XYZ
)
public:
static void SetPosition(
	Element^ bendingDetail,
	XYZ^ position
)
static member SetPosition :
        bendingDetail : Element *
        position : XYZ -> unit
Parameters
bendingDetail Element
 The bending detail for which we want to get the position.
position XYZ
 The new position for this bending detail relative to its view.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace